docs/1c-export-mobile/MobileAgent/DataProcessors/Чат1с.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>Чат1с</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Чат</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/DataProcessors/Чат1с/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем мБуферОбмена Экспорт;

&НаКлиенте
Перем РеакцияДляЭлемента;

&НаКлиенте
Перем мСообщение;

&НаСервере
Перем выводитьДату;

&НаСервере
Перем ЦветФона, ЦветФонаБелый;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	//Значение = ХранилищаНастроек.ХранилищеНастроекФормаЧата.Загрузить("Чат1с", "Чат1с");
	//Если Значение <> Неопределено Тогда 
	//Элементы.ОсновнаяСтарница.ПодчиненныеЭлементы
	//КонецЕсли;
	
	//Обмен_УправлениеОбменом.ОновитьЧат();
	СоздатьРеквизитиДляИзображений();
	ПрорисовкаФормы_СтраницаЧаты();
	
КонецПроцедуры

&НаСервере
Процедура  СоздатьРеквизитиДляИзображений()
	МассивРеквизитов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыЧата.Ссылка КАК Ссылка,
	|	ГруппыЧата.КартинкаГруппы КАК КартинкаГруппы
	|ИЗ
	|	Справочник.ГруппыЧата КАК ГруппыЧата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Имя = ПолучитьИмяЭлемента("к_", Выборка.Ссылка.УникальныйИдентификатор());
		ТипЗначения = Новый ОписаниеТипов("строка");
		РеквизитФормы = Новый РеквизитФормы(Имя, ТипЗначения);
		
		МассивРеквизитов.Добавить(РеквизитФормы);
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);	
	
	Выборка.Сбросить();
	
	мКартинка = Новый Картинка(Обработки.Чат1с.ПолучитьМакет("ИконкаЧата"));
	Пока Выборка.Следующий() Цикл
		
		Картинка = Выборка.КартинкаГруппы.Получить();
		
		Если ТипЗнч(Картинка) = Тип("ДвоичныеДанные") Тогда
			Картинка = Новый Картинка(Картинка, Истина);
		ИначеЕсли Не ТипЗнч(Картинка) = Тип("Картинка") Тогда
			Картинка = мКартинка;
		КонецЕсли;
		ЭтаФорма[ПолучитьИмяЭлемента("к_", Выборка.Ссылка.УникальныйИдентификатор())] =  ПоместитьВоВременноеХранилище(Картинка, Новый УникальныйИдентификатор);

	КонецЦикла;
	
	Реакция = ПоместитьВоВременноеХранилище(Новый Картинка(Обработки.Чат1с.ПолучитьМакет("ИконкаРеакция")), Новый УникальныйИдентификатор);
	МояРеакция = ПоместитьВоВременноеХранилище(Новый Картинка(Обработки.Чат1с.ПолучитьМакет("ИконкаМояРеакция")), Новый УникальныйИдентификатор);
	
КонецПроцедуры


&НаСервере
Процедура ПрорисовкаФормы_СтраницаЧаты();
	
	СтраницаЧат = Элементы.Чаты;
	
	//мЭкраны = ПолучитьИнформациюЭкрановКлиента();
	//Сообщить( "ВысотаЭкрана = " + Формат(мЭкраны[0].Высота, "ЧГ=") + "ШиринаЭкрана = " Формат(мЭкраны[0].Ширина, "ЧГ="));
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ГруппаЧата КАК ГруппаЧата,
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВЫРАЗИТЬ(ВложенныйЗапрос.Повідомлення КАК СТРОКА(40)) КАК Повідомлення
	|ПОМЕСТИТЬ ПоследниеСообщения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВходящиеСообщения.ГруппаЧата КАК ГруппаЧата,
	|		ВходящиеСообщения.Дата КАК Дата,
	|		ВходящиеСообщения.Повідомлення КАК Повідомлення
	|	ИЗ
	|		РегистрСведений.ВходящиеСообщения КАК ВходящиеСообщения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ВходящиеСообщения.ГруппаЧата КАК ГруппаЧата,
	|				МАКСИМУМ(ВходящиеСообщения.Дата) КАК Дата
	|			ИЗ
	|				РегистрСведений.ВходящиеСообщения КАК ВходящиеСообщения
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдаленныеСообщения КАК УдаленныеСообщения
	|					ПО ВходящиеСообщения.Уид_Сообщения = УдаленныеСообщения.УИД_Сообщения
	|			ГДЕ
	|				УдаленныеСообщения.УИД_Сообщения ЕСТЬ NULL
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВходящиеСообщения.ГруппаЧата) КАК ВложенныйЗапрос
	|			ПО ВходящиеСообщения.Дата = ВложенныйЗапрос.Дата
	|				И ВходящиеСообщения.ГруппаЧата = ВложенныйЗапрос.ГруппаЧата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИсходящиеСообщения.Получатель,
	|		ИсходящиеСообщения.Дата,
	|		ИсходящиеСообщения.Повідомлення
	|	ИЗ
	|		РегистрСведений.ИсходящиеСообщения КАК ИсходящиеСообщения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МАКСИМУМ(ИсходящиеСообщения.Дата) КАК Дата,
	|				ИсходящиеСообщения.Получатель КАК Получатель
	|			ИЗ
	|				РегистрСведений.ИсходящиеСообщения КАК ИсходящиеСообщения
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдаленныеСообщения КАК УдаленныеСообщения
	|					ПО ИсходящиеСообщения.Уид_Сообщения = УдаленныеСообщения.УИД_Сообщения
	|			ГДЕ
	|				УдаленныеСообщения.УИД_Сообщения ЕСТЬ NULL
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ИсходящиеСообщения.Получатель) КАК ВложенныйЗапрос
	|			ПО ИсходящиеСообщения.Дата = ВложенныйЗапрос.Дата
	|				И ИсходящиеСообщения.Получатель = ВложенныйЗапрос.Получатель) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыЧата.Код КАК Код,
	|	ГруппыЧата.Наименование КАК Наименование,
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.Повідомлення КАК Повідомлення,
	|	ГруппыЧата.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(НепрочитаныеСообщенияСрезПоследних.кол, 0) КАК НеПрочитаные
	|ИЗ
	|	Справочник.ГруппыЧата КАК ГруппыЧата
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПоследниеСообщения.ГруппаЧата КАК ГруппаЧата,
	|			ПоследниеСообщения.Дата КАК Дата,
	|			ПоследниеСообщения.Повідомлення КАК Повідомлення
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ПоследниеСообщения.ГруппаЧата КАК ГруппаЧата,
	|				МАКСИМУМ(ПоследниеСообщения.Дата) КАК Дата
	|			ИЗ
	|				ПоследниеСообщения КАК ПоследниеСообщения
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ПоследниеСообщения.ГруппаЧата) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеСообщения КАК ПоследниеСообщения
	|				ПО ВложенныйЗапрос.ГруппаЧата = ПоследниеСообщения.ГруппаЧата
	|					И ВложенныйЗапрос.Дата = ПоследниеСообщения.Дата) КАК ВложенныйЗапрос
	|		ПО ГруппыЧата.Ссылка = ВложенныйЗапрос.ГруппаЧата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НепрочитаныеСообщения.СрезПоследних(, ) КАК НепрочитаныеСообщенияСрезПоследних
	|		ПО ГруппыЧата.Ссылка = НепрочитаныеСообщенияСрезПоследних.Отправитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ ПО
	|	Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГруппыЧатов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппыЧатов.Следующий() Цикл
		Имя = "Чат" + ВыборкаГруппыЧатов.Код;
		
		ЧатКод = Элементы.Добавить(Имя, Тип("ГруппаФормы"), СтраницаЧат);
		ЧатКод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЧатКод.Группировка =  ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ЧатКод.ОтображатьЗаголовок = Ложь;
		//ЧатКод.ВертикальныйИнтервал =  ИнтервалМеждуЭлементамиФормы.Половинный;
		Выборка = ВыборкаГруппыЧатов.Выбрать();
		Выборка.Следующий();
		
		
		Элемент = Элементы.Добавить(Имя + "Картинка", Тип("ПолеФормы"), ЧатКод);
		Элемент.Вид = ВидПоляФормы.ПолеКартинки;
		Элемент.Ширина = 6;
		Элемент.Высота = 2;
		//Элемент.Картинка = БиблиотекаКартинок.группаЧат1с;
		Элемент.ПутьКДанным = ПолучитьИмяЭлемента("к_", Выборка.Ссылка.УникальныйИдентификатор());
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.РазмерКартинки = РазмерКартинки.Пропорционально;
		Элемент.УстановитьДействие("Нажатие", "ЧатКодНаименованиеНажатие");
		Элемент.Гиперссылка = Истина;
		Элемент.Подсказка = Выборка.Ссылка.УникальныйИдентификатор(); 
		Элемент.РастягиватьПоВертикали = Ложь;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
		Элемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		
		ЧатКодГруппа = Элементы.Добавить(Имя + "Группа", Тип("ГруппаФормы"), ЧатКод);
		ЧатКодГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЧатКодГруппа.Группировка =  ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ЧатКодГруппа.ОтображатьЗаголовок = Ложь;
		ЧатКодГруппа.РастягиватьПоГоризонтали = Истина;
		
		Элемент = Элементы.Добавить(Имя + "Наименование", Тип("ДекорацияФормы"), ЧатКодГруппа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Шрифт = Новый Шрифт(,10, Истина);
		Элемент.Гиперссылка = Истина;
		Элемент.Подсказка = Выборка.Ссылка.УникальныйИдентификатор(); 
		Элемент.Заголовок = Выборка.Наименование;
		Элемент.УстановитьДействие("Нажатие", "ЧатКодНаименованиеНажатие");
		
		Элемент = Элементы.Добавить(Имя + "Сообщение", Тип("ДекорацияФормы"), ЧатКодГруппа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = СтрЗаменить(Выборка.Повідомлення, Символы.ПС, " ");
		Элемент.РастягиватьПоВертикали = ложь;
		Элемент.Высота = 1;
		
		Элемент = Элементы.Добавить(Имя + "Непрочитаные", Тип("ДекорацияФормы"), ЧатКод);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = Формат(Выборка.НеПрочитаные, "ЧН=' '");
		Элемент.Шрифт = Новый Шрифт(,10);
		Элемент.ЦветТекста = Новый Цвет(225,0,0);
		Элемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
		Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		Элемент.Ширина = 5;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПрорисовкаФормы_СтраницаЧат(Имя, УИД_Чата)
	
	
	Страница = Элементы.Добавить(Имя, Тип("ГруппаФормы"), элементы.ОсновнаяСтарница);
	Страница.Вид = ВидГруппыФормы.Страница;
	Страница.РастягиватьПоГоризонтали = Истина;
	Страница.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
	Страница.Подсказка = УИД_Чата; 
	//ПрорисовкаФормы_СтраницаЧат_Шапка(Имя, Чат.Наименование);
	//Страница.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	Страница.ВертикальнаяПрокруткаПриСжатии = Истина;
	
	Элемент = Элементы.Добавить(Имя + "Картинка", Тип("ДекорацияФормы"), Страница);
	Элемент.Вид = ВидДекорацииФормы.Картинка;
	Элемент.Высота = 1;
	Элемент.РастягиватьПоГоризонтали = Истина;
	Элемент.Картинка = БиблиотекаКартинок.Обновить;
	Элемент.РазмерКартинки = РазмерКартинки.Пропорционально;
	Элемент.УстановитьДействие("Нажатие", "ЧатЭлементПолучитьЕщeНажатие");
	Элемент.Подсказка = УИД_Чата;
	Элемент.Гиперссылка = истина;
	
	ПрорисовкаФормы_Сообщения(Имя, УИД_Чата);
	
КонецПроцедуры

&НаСервере
процедура ПрорисовкаФормы_Сообщения(Имя, УИД_Чата) 
	Перем Отправитель, Дата;
	
	ЦветФона = Новый Цвет(242, 242, 242);
	ЦветФонаБелый = Новый Цвет(255, 255, 255);
	
	УникальныйИдентификатор_Чат = Новый УникальныйИдентификатор(УИД_Чата);
	Чат = Справочники.ГруппыЧата.ПолучитьСсылку(УникальныйИдентификатор_Чат);
	//ОткрытыеЧаты.ДОбавить().чат = чат;
	ТЗ_СообщенияЧата = Объект.Сообщения.Выгрузить(Новый Структура("Чат", УникальныйИдентификатор_Чат));
	
	Запрос = Новый Запрос;
	Запрос.Текст = // ПЕРВЫЕ "  + ТЗ_СообщенияЧата.Количество() + 20 + "
   
	"ВЫБРАТЬ  ПЕРВЫЕ "  + (ТЗ_СообщенияЧата.Количество() + 20) + "
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.Відправник КАК Відправник,
	|	ВложенныйЗапрос.Уид_Сообщения КАК Уид_Сообщения,
	|	ВложенныйЗапрос.Повідомлення КАК Повідомлення,
	|	ВложенныйЗапрос.Входящее КАК Входящее,
	|	ЕСТЬNULL(Реакции.КоличествоРеакций, 0) КАК КоличествоРеакций,
	|	ЕСТЬNULL(Реакции.МояРеакция, ЛОЖЬ) КАК МояРеакция
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВходящиеСообщения.Дата КАК Дата,
	|		ВходящиеСообщения.Відправник КАК Відправник,
	|		ВходящиеСообщения.Уид_Сообщения КАК Уид_Сообщения,
	|		ВходящиеСообщения.Повідомлення КАК Повідомлення,
	|		ИСТИНА КАК Входящее
	|	ИЗ
	|		РегистрСведений.ВходящиеСообщения КАК ВходящиеСообщения
	|	ГДЕ
	|		ВходящиеСообщения.ГруппаЧата = &ГруппаЧата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИсходящиеСообщения.Дата,
	|		NULL,
	|		ИсходящиеСообщения.Уид_Сообщения,
	|		ИсходящиеСообщения.Повідомлення,
	|		ЛОЖЬ
	|	ИЗ
	|		РегистрСведений.ИсходящиеСообщения КАК ИсходящиеСообщения
	|	ГДЕ
	|		ИсходящиеСообщения.Получатель = &ГруппаЧата) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдаленныеСообщения КАК УдаленныеСообщения
	|		ПО ВложенныйЗапрос.Уид_Сообщения = УдаленныеСообщения.УИД_Сообщения
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РекацииНаСобщения.УИД_Сообщения КАК УИД_Сообщения,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РекацииНаСобщения.УчастникЧата) КАК КоличествоРеакций,
	|			МАКСИМУМ(РекацииНаСобщения.УчастникЧата = &ЭтотТорговый) КАК МояРеакция
	|		ИЗ
	|			РегистрСведений.РекацииНаСобщения КАК РекацииНаСобщения
	|		ГДЕ
	|			РекацииНаСобщения.Реакция
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РекацииНаСобщения.УИД_Сообщения) КАК Реакции
	|		ПО ВложенныйЗапрос.Уид_Сообщения = Реакции.УИД_Сообщения
	|ГДЕ
	|	УдаленныеСообщения.УИД_Сообщения ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 20
	|	ВТ.Дата КАК Дата,
	|	ВТ.Відправник КАК Відправник,
	|	ВТ.Уид_Сообщения КАК Уид_Сообщения,
	|	ВТ.Повідомлення КАК Повідомлення,
	|	ВТ.Входящее КАК Входящее,
	|	ВТ.КоличествоРеакций КАК КоличествоРеакций,
	|	ВТ.МояРеакция КАК МояРеакция
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.Дата";
	
	Запрос.УстановитьПараметр("ЭтотТорговый", Константы.Пользователь1с.Получить());
	Запрос.УстановитьПараметр("ГруппаЧата", Чат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_СообщенияЧата.Сортировать("Дата");
	//НовоеСообщение = Ложь;
	Если ТЗ_СообщенияЧата.Количество() Тогда 
		Предедущий = Имя + Формат(ТЗ_СообщенияЧата[0].Дата, "ДФ=ddMMyy");//ТЗ_СообщенияЧата[0].Сообщение;
		//Дата = НачалоДня(ТЗ_СообщенияЧата[0].Дата); 
		//НовоеСообщение = Истина;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	//ИндексЕлемента = 1;
	выводитьДату = Истина;
	Пока Выборка.Следующий() Цикл 
		Создано = Ложь;
		Если выводитьДату И Дата <> НачалоДня(Выборка.Дата) Тогда 
			
			ПрорисовкаФормы_СтраницаЧат_Дата(Имя, Выборка.Дата, Предедущий);
			Дата = НачалоДня(Выборка.Дата);
			
		//ИначеЕсли НовоеСообщение Тогда 
		//	
		//	НовоеСообщение = Ложь;
		//	ИмяЭлемента = 
		//	Предедущий = Элементы.Найти(ИмяЭлемента);
			
		КонецЕсли;
		
		Если Выборка.Входящее Тогда 
			ОтображатьОтправителя = Не Отправитель = Выборка.Відправник;
			ПрорисовкаФормы_ДобавитьВходящееСообщение(Выборка, Имя, ОтображатьОтправителя, Предедущий, Создано);
		Иначе 
			ПрорисовкаФормы_ДобавитьИсходящееСообщение(Выборка, Имя, Предедущий, Создано);
		КонецЕсли;
		
		Если Создано Тогда 
			ИндексиСообщений = Объект.Сообщения.Добавить();
			ИндексиСообщений.Чат = УникальныйИдентификатор_Чат;
			ИндексиСообщений.Сообщение = Выборка.Уид_Сообщения;
			ИндексиСообщений.Дата = Выборка.Дата; 
		КонецЕсли;
		
		
		
		Отправитель = Выборка.Відправник;
		//ИндексЕлемента = ИндексЕлемента + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрорисовкаФормы_СтраницаЧат_Шапка(Имя, Чат)
	
	//Страница = Элементы.Добавить(Имя + "ПерепискаГМ", Тип("ГруппаФормы"), Элементы[Имя]);
	//Страница.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//Страница.РастягиватьПоГоризонтали = Истина;
	
	//Элемент = Элементы.Добавить(Имя + "ПерепискаГМНазад", Тип("ДекорацияФормы"), Страница);
	//Элемент.Вид = ВидДекорацииФормы.Картинка;
	//Элемент.Ширина = 3;
	//Элемент.Высота = 1;
	//
	////Элемент.Шрифт = Новый Шрифт(,,Истина);
	//Элемент.Гиперссылка = Истина;
	////Элемент.Подсказка = Выборка.Ссылка.УникальныйИдентификатор(); 
	////Элемент.Заголовок = Выборка.Наименование;
	//Элемент.УстановитьДействие("Нажатие", "ПерепискаГМНазадНажатие");
	//Элемент.Картинка = БиблиотекаКартинок.Назад;
	//
	//Элемент = Элементы.Добавить(Имя + "Сообщение", Тип("ДекорацияФормы"), Страница);
	//Элемент.Вид = ВидДекорацииФормы.Надпись;
	//Элемент.Заголовок = Чат;
	//Элемент.Шрифт = Новый Шрифт(,8,Истина);
	//
	
КонецПроцедуры

&НаСервере
Процедура ПрорисовкаФормы_ДобавитьВходящееСообщение(ДанныеСообщения, ИмяЧата, ОтображатьОтправителя, ПередСообщением = Неопределено, Создано)
	перем ПередЭлементом;
	прПоиск = "";
	Если СтрНайти(ИмяЧата, "Поиск") Тогда 
		прПоиск = "Поиск";
	КонецЕсли;
	
	Имя = ПолучитьИмяЭлемента("ВходящееСообщение" + прПоиск, ДанныеСообщения.Уид_Сообщения);
	
	Если Не Элементы.Найти(Имя) = Неопределено Тогда 
		выводитьДату = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПередСообщением) Тогда
		ПередЭлементом = Элементы.Найти(ПолучитьИмяЭлемента("ВходящееСообщение", ПередСообщением));
		Если ПередЭлементом = Неопределено Тогда 	
			ПередЭлементом = Элементы.Найти(ПолучитьИмяЭлемента("ИсходящееСообщение", ПередСообщением));
		КонецЕсли;
		Если ПередЭлементом = Неопределено Тогда 
				 ПередЭлементом = Элементы.Найти(ПередСообщением);
			КонецЕсли;

	КонецЕсли;
	
	#Область ВходящееСообщение
	Группа = Элементы.Вставить(Имя, Тип("ГруппаФормы"), Элементы[ИмяЧата], ПередЭлементом);
	Группа.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.РастягиватьПоВертикали			= Ложь;
	Группа.ОтображатьЗаголовок 				= Ложь;
	Группа.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Лево;
	Группа.ЦветФона 						= ЦветФона;
	
	
	
	// ТелоСообщенияГоризонт
	мГруппа = Элементы.Добавить(Имя + "ТелоСообщенияГоризонт", Тип("ГруппаФормы"), Группа);
	мГруппа.Вид 							= ВидГруппыФормы.ОбычнаяГруппа;
	мГруппа.Группировка 					= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
	мГруппа.ОтображатьЗаголовок 			= Ложь;
	мГруппа.ЦветФона 						= ЦветФонаБелый;
	
	
	#Область ГруппаРеакция
	ГруппаРеакция =  Элементы.Добавить(Имя + "ДанныеРеакции", Тип("ГруппаФормы"), Группа);
	ГруппаРеакция.Вид 							= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаРеакция.Группировка 					= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;	
	ГруппаРеакция.ОтображатьЗаголовок 			= Ложь;	
	ГруппаРеакция.ВертикальноеПоложениеВГруппе 	= ВертикальноеПоложениеЭлемента.Центр;

	// Реакция
	Элемент = Элементы.Добавить(Имя + "Реакция", Тип("ПолеФормы"), ГруппаРеакция);
	Элемент.Вид 							= ВидПоляФормы.ПолеКартинки;
	Элемент.Ширина 							= 2;
	Элемент.Высота 							= 1;
	Элемент.ПутьКДанным 					= ?(ДанныеСообщения.МояРеакция, "МояРеакция", "Реакция");
	Элемент.ПоложениеЗаголовка 				= ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элемент.РазмерКартинки 					= РазмерКартинки.Пропорционально;	
	Элемент.Гиперссылка 					= Истина;
	Элемент.Подсказка 						= ДанныеСообщения.Уид_Сообщения; 
	Элемент.РастягиватьПоВертикали 			= Ложь;
	Элемент.РастягиватьПоГоризонтали 		= Ложь;
	Элемент.Рамка  							= Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	Элемент.ВертикальноеПоложениеВГруппе 	= ВертикальноеПоложениеЭлемента.Центр;
	Элемент.УстановитьДействие("Нажатие", "РеакияНажатие");
	
	// КоличествоРеакция
	Элемент = Элементы.Добавить(Имя + "КоличествоРеакция", Тип("ДекорацияФормы"), ГруппаРеакция);
	Элемент.Вид 							= ВидДекорацииФормы.Надпись;
	Элемент.Ширина 							= 2;
	Элемент.ГоризонтальноеПоложение 		= ГоризонтальноеПоложениеЭлемента.Центр;
	Элемент.Заголовок						= Формат(ДанныеСообщения.КоличествоРеакций, "ЧДЦ=0");
	Элемент.Шрифт							= Новый Шрифт(,6);
	#КонецОбласти
	
	// Отступ
	Элемент = Элементы.Добавить(Имя + "Отступ", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид 							= ВидДекорацииФормы.Надпись;
	Элемент.Ширина 							= 0;
	
	
	#Область ТелоСообщенияГоризонт
	
	//ОтступСЛева
	Элемент = Элементы.Добавить(Имя + "ОтступСЛева", Тип("ДекорацияФормы"), мГруппа);
	Элемент.Вид 							= ВидДекорацииФормы.Надпись;
	Элемент.Ширина 							= 0;
	
	
	#Область ТелоСообщения
	Группа = Элементы.Добавить(Имя + "ТелоСообщения", Тип("ГруппаФормы"), мГруппа);
	Группа.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;	
	Группа.ОтображатьЗаголовок 				= Ложь;
	
	
	//Отправитель
	Если ОтображатьОтправителя Тогда 
		Элемент 							= Элементы.Добавить(Имя + "Отправитель", Тип("ДекорацияФормы"), Группа);
		Элемент.Вид 						= ВидДекорацииФормы.Надпись;
		Элемент.Шрифт 						= Новый Шрифт(,,Истина);
		Элемент.Заголовок 					= "" + ДанныеСообщения.Відправник + ":";
		Элемент.ЦветТекста 					= Новый Цвет(0, 38, 255);
	КонецЕсли;
	
	//ТекстСообщения
	//Группа = Элементы.Добавить(Имя + "ТекстСообщения", Тип("ГруппаФормы"), Группа);
	//Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
	//Группа.ОтображатьЗаголовок = Ложь;
	
	//Текст
	Элемент = Элементы.Добавить(Имя + "Текст", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид 							= ВидДекорацииФормы.Надпись;
	Элемент.Заголовок 						= СокрЛП(ДанныеСообщения.Повідомлення);
	Элемент.ГоризонтальноеПоложение 		= ГоризонтальноеПоложениеЭлемента.Лево;
	
	#КонецОбласти
	
	#Область ДопМеню
	Группа = Элементы.Вставить(Имя + "ДопМеню", Тип("ГруппаФормы"), мГруппа);
	Группа.Вид 								= ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка 						= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.ОтображатьЗаголовок 				= Ложь;
	Группа.РастягиватьПоВертикали  			= Истина;
	//Группа.ЦветФона = Новый Цвет(255,255,255);
	
	//Меню
	Элемент 								= Элементы.Добавить(Имя + "Меню", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид 							= ВидДекорацииФормы.Картинка;
	Элемент.Ширина							= 1;
	Элемент.Высота 							= 1;
	Элемент.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Право;
	Элемент.ВертикальноеПоложениеВГруппе 	= ВертикальноеПоложениеЭлемента.Верх;
	Элемент.Картинка 						= БиблиотекаКартинок.Меню;
	Элемент.Гиперссылка 					= Истина;
	Элемент.Подсказка 						= ДанныеСообщения.Уид_Сообщения; 
	Элемент.РазмерКартинки 					= РазмерКартинки.АвтоРазмер;
	 Элемент.УстановитьДействие("Нажатие", "МенюСообщенияНажатие");

	//Время
	Элемент = Элементы.Добавить(Имя + "Время", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид 							= ВидДекорацииФормы.Надпись;
	Элемент.Заголовок 						= Формат(ДанныеСообщения.Дата, "ДФ=ЧЧ:мм");;
	Элемент.Шрифт 							= Новый Шрифт(,5);
	Элемент.ГоризонтальноеПоложениеВГруппе  = ГоризонтальноеПоложениеЭлемента.Право;
	Элемент.ВертикальноеПоложениеВГруппе 	= ВертикальноеПоложениеЭлемента.Низ;
	
	#КонецОбласти
	
	#КонецОбласти
	
	#КонецОбласти
	
	Создано = Истина;
КонецПроцедуры

&НаСервере
Процедура ПрорисовкаФормы_ДобавитьИсходящееСообщение(ДанныеСообщения, ИмяЧата, ПередСообщением = Неопределено, Создано);
	
	прПоиск = "";
	Если СтрНайти(ИмяЧата, "Поиск") Тогда 
		прПоиск = "Поиск";
	КонецЕсли;
	
	Имя = ПолучитьИмяЭлемента("ИсходящееСообщение" + прПоиск, ДанныеСообщения.Уид_Сообщения);
	
	
	Если Не Элементы.Найти(Имя) = Неопределено Тогда 
		выводитьДату = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПередСообщением) Тогда
		ПередЭлементом = Элементы.Найти(ПолучитьИмяЭлемента("ВходящееСообщение", ПередСообщением));
		Если ПередЭлементом = Неопределено Тогда 	
			ПередЭлементом = Элементы.Найти(ПолучитьИмяЭлемента("ИсходящееСообщение", ПередСообщением));
		КонецЕсли;
		Если ПередЭлементом = Неопределено Тогда 
			ПередЭлементом = Элементы.Найти(ПередСообщением);
		КонецЕсли;
		
	КонецЕсли;
	
	
	Группа = Элементы.Вставить(Имя, Тип("ГруппаФормы"), Элементы[ИмяЧата], ПередЭлементом);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.ОтображатьЗаголовок 				= Ложь;
	Группа.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Право;
	Группа.РастягиватьПоГоризонтали 		= Ложь;
	Группа.РастягиватьПоВертикали			= Ложь;
	Группа.ЦветФона 						= ЦветФона;
	
	
	Элемент = Элементы.Добавить(Имя + "Отступ", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Ширина = 0;
	
	#Область ГруппаРеакция
	ГруппаРеакция = Элементы.Добавить(Имя + "ДанныеРеакции", Тип("ГруппаФормы"), Группа);
	ГруппаРеакция.Вид 							= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаРеакция.Группировка 					= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;	
	ГруппаРеакция.ОтображатьЗаголовок 			= Ложь;	
	ГруппаРеакция.ВертикальноеПоложениеВГруппе 	= ВертикальноеПоложениеЭлемента.Центр;

	// Реакция
	Элемент = Элементы.Добавить(Имя + "Реакция", Тип("ПолеФормы"), ГруппаРеакция);
	Элемент.Вид 							= ВидПоляФормы.ПолеКартинки;
	Элемент.Ширина 							= 2;
	Элемент.Высота 							= 1;
	Элемент.ПутьКДанным 					= ?(ДанныеСообщения.МояРеакция, "МояРеакция", "Реакция");
	Элемент.ПоложениеЗаголовка 				= ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элемент.РазмерКартинки 					= РазмерКартинки.Пропорционально;	
	Элемент.Гиперссылка 					= Истина;
	Элемент.Подсказка 						= ДанныеСообщения.Уид_Сообщения; 
	Элемент.РастягиватьПоВертикали 			= Ложь;
	Элемент.РастягиватьПоГоризонтали 		= Ложь;
	Элемент.Рамка  							= Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	Элемент.ВертикальноеПоложениеВГруппе 	= ВертикальноеПоложениеЭлемента.Центр;
	Элемент.УстановитьДействие("Нажатие", "РеакияНажатие");
	
	// КоличествоРеакция
	Элемент = Элементы.Добавить(Имя + "КоличествоРеакция", Тип("ДекорацияФормы"), ГруппаРеакция);
	Элемент.Вид 							= ВидДекорацииФормы.Надпись;
	Элемент.Ширина 							= 2;
	Элемент.ГоризонтальноеПоложение 		= ГоризонтальноеПоложениеЭлемента.Центр;
	Элемент.Заголовок						= Формат(ДанныеСообщения.КоличествоРеакций, "ЧДЦ=0");
	Элемент.Шрифт							= Новый Шрифт(,6);
	#КонецОбласти

	Группа = Элементы.Добавить(Имя + "ТелоСообщенияГоризонт", Тип("ГруппаФормы"), Группа);
	Группа.Вид 							= ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка 					= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
	Группа.ОтображатьЗаголовок 			= Ложь;
	Группа.ЦветФона 					= ЦветФонаБелый;

	Элемент = Элементы.Добавить(Имя + "Текст", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Заголовок = СокрЛП(ДанныеСообщения.Повідомлення);
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина = 32;
	Элемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
	Элемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	//Элемент.ЦветФона = ЦветФонаБелый;
	
	Группа = Элементы.Вставить(Имя + "ДопМеню", Тип("ГруппаФормы"), Группа);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.РастягиватьПоВертикали  = Истина;
	//Группа.ЦветФона = ЦветФонаБелый;
	
	Элемент = Элементы.Добавить(Имя + "Меню", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид = ВидДекорацииФормы.Картинка;
	Элемент.Ширина = 1;
	Элемент.Высота = 1;
	Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	Элемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	Элемент.Картинка = БиблиотекаКартинок.Меню;
	Элемент.Гиперссылка = Истина;
	Элемент.УстановитьДействие("Нажатие", "МенюСообщенияНажатие");
	Элемент.Подсказка = ДанныеСообщения.Уид_Сообщения; 
	Элемент.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	
	Элемент = Элементы.Добавить(Имя + "Время", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Заголовок = Формат(ДанныеСообщения.Дата, "ДФ=ЧЧ:мм");;
	Элемент.Шрифт = Новый Шрифт(,5);
	Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	Элемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	
	
	
	Создано = Истина;
КонецПроцедуры

Процедура ПрорисовкаФормы_СтраницаЧат_Дата(ИмяЧата, Дата, ПередСообщением = Неопределено)
	
	ИмяЭлемента = ИмяЧата + Формат(Дата, "ДФ=ddMMyy");
	Если ИмяЭлемента = ПередСообщением Тогда 
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.Найти(ИмяЭлемента);
	Если Элемент <> Неопределено Тогда 
		Элементы.Удалить(Элемент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПередСообщением) Тогда
		ПередЭлементом = Элементы.Найти(ПолучитьИмяЭлемента("ВходящееСообщение", ПередСообщением));
		Если ПередЭлементом = Неопределено Тогда 	
			ПередЭлементом = Элементы.Найти(ПолучитьИмяЭлемента("ИсходящееСообщение", ПередСообщением));
			Если ПередЭлементом = Неопределено Тогда 
				 ПередЭлементом = Элементы.Найти(ПередСообщением);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	
	//Элементы.Вставить(ИмяЭлемента, 
	Элемент = Элементы.Вставить(ИмяЭлемента, Тип("ДекорацияФормы"), Элементы[ИмяЧата], ПередЭлементом);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Заголовок = Формат(Дата, "ДФ='dd MMMM'");
	Элемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	Элемент.РастягиватьПоГоризонтали = истина;
	
КонецПроцедуры


Функция ПолучитьИмяЭлемента(Префикс, УИД)
	Возврат Префикс + СтрЗаменить(УИД, "-", "");	
КонецФункции



&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Хранилище = Новый ХранилищеЗначения(Элементы);
	
	//
	//ХранилищаНастроек.ХранилищеНастроекФормаЧата.Сохранить("Чат1с", "Чат1с", Хранилище); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаименованиеГруппыЧата(УИД_Чата)
	
	Возврат Справочники.ГруппыЧата.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД_Чата)).Наименование;
	
КонецФункции


&НаКлиенте
Процедура ОтправкаСообщенияСообщениеИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	мСообщение = Текст;
КонецПроцедуры

&НаКлиенте
Процедура АвтообновлениеЧата()
	АвтообновлениеЧатаНаСервере();
КонецПроцедуры

Процедура АвтообновлениеЧатаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сообщения.Сообщение КАК Сообщение,
	//|	Сообщения.ИндексЕлемента КАК ИндексЕлемента,
	|	Сообщения.Дата КАК Дата
	|ПОМЕСТИТЬ вт_сообщения
	|ИЗ
	|	&Сообщения КАК Сообщения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сообщение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВходящиеСообщения.Дата КАК Дата,
	|	ВходящиеСообщения.Відправник КАК Відправник,
	|	ВходящиеСообщения.ГруппаЧата КАК ГруппаЧата,
	|	ВходящиеСообщения.Уид_Сообщения КАК Уид_Сообщения,
	|	ВходящиеСообщения.Повідомлення КАК Повідомлення,
	//|	ЕСТЬNULL(вт_сообщения.ИндексЕлемента, 0) КАК ИндексЕлемента
	|ПОМЕСТИТЬ НовыеСообщения
	|ИЗ
	|	РегистрСведений.ВходящиеСообщения КАК ВходящиеСообщения
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_сообщения КАК вт_сообщения
	|		ПО ВходящиеСообщения.Уид_Сообщения = вт_сообщения.Сообщение
	|ГДЕ
	//|	вт_сообщения.ИндексЕлемента ЕСТЬ NULL
	|	 ВходящиеСообщения.ГруппаЧата В(&ГруппаЧата)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ вт_сообщения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеСообщения.Дата КАК Дата,
	|	НовыеСообщения.Відправник КАК Відправник,
	|	НовыеСообщения.ГруппаЧата КАК ГруппаЧата,
	|	НовыеСообщения.Уид_Сообщения КАК Уид_Сообщения,
	|	НовыеСообщения.Повідомлення КАК Повідомлення,
	//|	НовыеСообщения.ИндексЕлемента КАК ИндексЕлемента,
	|	ЕСТЬNULL(ВложенныйЗапрос.Уид_Сообщения, НЕОПРЕДЕЛЕНО) КАК Уид_СообщенияСлед
	|ИЗ
	|	НовыеСообщения КАК НовыеСообщения
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ИсходящиеСообщения.Получатель КАК Получатель,
	|			ИсходящиеСообщения.Дата КАК Дата,
	|			ИсходящиеСообщения.Уид_Сообщения КАК Уид_Сообщения,
	|			ВложенныйЗапрос.Уид_НовогоСообщения КАК Уид_НовогоСообщения
	|		ИЗ
	|			РегистрСведений.ИсходящиеСообщения КАК ИсходящиеСообщения
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МИНИМУМ(ИсходящиеСообщения.Дата) КАК Дата,
	|					ИсходящиеСообщения.Получатель КАК Получатель,
	|					НовыеСообщения.Уид_Сообщения КАК Уид_НовогоСообщения
	|				ИЗ
	|					НовыеСообщения КАК НовыеСообщения
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсходящиеСообщения КАК ИсходящиеСообщения
	|						ПО НовыеСообщения.Дата < ИсходящиеСообщения.Дата
	|							И НовыеСообщения.ГруппаЧата = ИсходящиеСообщения.Получатель
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ИсходящиеСообщения.Получатель,
	|					НовыеСообщения.Уид_Сообщения) КАК ВложенныйЗапрос
	|				ПО ИсходящиеСообщения.Дата = ВложенныйЗапрос.Дата
	|					И ИсходящиеСообщения.Получатель = ВложенныйЗапрос.Получатель) КАК ВложенныйЗапрос
	|		ПО НовыеСообщения.Уид_Сообщения = ВложенныйЗапрос.Уид_НовогоСообщения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ ПО
	|	ГруппаЧата";
	мОткрытыеЧаты = ОткрытыеЧаты.Выгрузить();
	
	Запрос.УстановитьПараметр("Сообщения", Объект.Сообщения.Выгрузить());
	Запрос.УстановитьПараметр("ГруппаЧата", мОткрытыеЧаты.ВыгрузитьКолонку("Чат"));
	
	РезультатЗапроса  = Запрос.Выполнить();	
	ВыборкаГрупы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Исходящее = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГрупы.Следующий() Цикл 
		УникальныйИдентификатор_Чат = ВыборкаГрупы.ГруппаЧата.УникальныйИдентификатор();
		Имя = ПолучитьИмяЭлемента("Чат",УникальныйИдентификатор_Чат);
		ГруппаЧат = Элементы.Найти(Имя);
		Если ГруппаЧат = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Выборка = ВыборкаГрупы.Выбрать();
		Пока Выборка.Следующий() Цикл 
			
			ИндексиСообщений = Объект.Сообщения.Добавить();
			ИндексиСообщений.Чат = УникальныйИдентификатор_Чат;
			ИндексиСообщений.Сообщение = Выборка.Уид_Сообщения;
			ИндексиСообщений.Дата = Выборка.Дата;
			ПрорисовкаФормы_ДобавитьВходящееСообщение(Выборка, Имя, Истина, Выборка.Уид_СообщенияСлед, Ложь);
			//ИндексиСообщений.ИндексЕлемента = ИндексЕлемента;
			
		КонецЦикла;
		
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключениеДрайверБуфераОбмена();	
	//ПодключитьОбработчикОжидания("АвтообновлениеЧата", 10);
	
КонецПроцедуры

Процедура ОновитьНепрочитаные(УИД_чата)
	
	Чат = Справочники.ГруппыЧата.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД_чата));
	НаборЗаписей = РегистрыСведений.НепрочитаныеСообщения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Отправитель.Установить(Чат);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() Тогда 
		НаборЗаписей[0].Кол = 0;
	КонецЕсли;
	НаборЗаписей.Записать();
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЧатКодНаименованиеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Найти(Элемент.Имя, "Пошук") Тогда 
		Имя = ПолучитьИмяЭлемента("ЧатПоиск", Элемент.Подсказка);
	Иначе			
		Имя = ПолучитьИмяЭлемента("Чат", Элемент.Подсказка);
		Элементы[СтрЗаменить(Элемент.Имя, "Наименование", "Непрочитаные")].Заголовок = "";
		ОновитьНепрочитаные(Элемент.Подсказка);
		
	КонецЕсли;
	
	
	Если Элементы.Найти(Имя) = Неопределено Тогда 
		ПрорисовкаФормы_СтраницаЧат(Имя, Элемент.Подсказка);
	Иначе
		
	КонецЕсли;
	Попытка
		Элементы.ПерепискаГМНаименование.Заголовок = НаименованиеГруппыЧата(Элемент.Подсказка);
	Исключение
	КонецПопытки;
	
	Элементы.ОсновнаяСтарница.ТекущаяСтраница = элементы[Имя];
	Элементы.ОтправкаСообщения.Видимость = Истина;
	
	Элементы.ПерепискаГМНазад.Видимость = Истина;
	Элементы.ПерепискаГМНаименование.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РеакияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РеакцияДляЭлемента = Элемент.Имя;
	ПодключитьОбработчикОжидания("ПоставитьРеакцию",0.1, Истина)
	
	
КонецПроцедуры

&НаСервере
Процедура РеакцияНажатиеНаСервере(ИмяЭлемента);
	Элемент = Элементы[ИмяЭлемента];
	УИД_Сообщения = Новый УникальныйИдентификатор(Элемент.Подсказка);
	УчастникЧата = Константы.Пользователь1с.Получить();
	
	Набор = РегистрыСведений.РекацииНаСобщения.СоздатьНаборЗаписей();
	Набор.Отбор.УИД_Сообщения.Установить(УИД_Сообщения);
	Набор.Отбор.УчастникЧата.Установить(УчастникЧата);
	Запись = Набор.Добавить();
	Запись.УИД_Сообщения = УИД_Сообщения;
	Запись.УчастникЧата = УчастникЧата;
	Запись.Дата = ТекущаяДата();
	Если Элемент.ПутьКДанным = "Реакция" Тогда 
		Запись.Реакция = Истина;
		ПутьКДанным = "МояРеакция";
	Иначе
		Запись.Реакция = Ложь;
		ПутьКДанным = "Реакция";
	КонецЕсли;
	Набор.Записать();
	
	Элементы.Удалить(Элемент);
	СоздатьЭлементРеакцияНаФорме(ИмяЭлемента, УИД_Сообщения, ПутьКДанным);  
КонецПроцедуры


&НаКлиенте
Процедура ПерепискаГМНазадНажатие(Элемент)
	
	Если Найти(Элементы.ОсновнаяСтарница.ТекущаяСтраница.Имя, "Поиск") Тогда 
		Имя ="ЧатыПошук";
	Иначе			
		Имя = "Чаты";
	КонецЕсли;
	
	Элементы.ОсновнаяСтарница.ТекущаяСтраница = элементы[Имя];
	Элементы.ОтправкаСообщения.Видимость = Ложь;
	Элементы.ПерепискаГМНазад.Видимость = Ложь;
	Элементы.ПерепискаГМНаименование.Видимость = Ложь;
	//Элементы.ТекстПоиска.Видимость = Ложь;
	//Элементы.ДекорацияПоиск.Видимость = Истина;
	
	
КонецПроцедуры

&НаСервере
Процедура ОтправкаСообщенияОтправитьНажатиеНаСервере(Отказ)
	
	
	Если ПустаяСтрока(ТекстВвода) Тогда 
		Возврат;
	КонецЕсли;
	ЦветФона = Новый Цвет(242, 242, 242);
	ЦветФонаБелый = Новый Цвет(255, 255, 255);

	
	ТекущаяСтраница = Элементы.ОсновнаяСтарница.ТекущаяСтраница;
	УИД = Новый УникальныйИдентификатор(ТекущаяСтраница.Подсказка);
	Получатель = Справочники.ГруппыЧата.ПолучитьСсылку(УИД);
	
	Менеджер = РегистрыСведений.ИсходящиеСообщения.СоздатьМенеджерЗаписи();
	Менеджер.Получатель = Получатель; 
	Менеджер.Дата = ТекущаяДата();
	Менеджер.Уид_Сообщения = Новый УникальныйИдентификатор();
	Менеджер.Повідомлення = ТекстВвода;
	Менеджер.Записать();
	
	ОтправитьСМС_НаСервер(Менеджер, Отказ);

	Данные = Новый Структура("Уид_Сообщения, Повідомлення, КоличествоРеакций, МояРеакция, Дата");
	ЗаполнитьЗначенияСвойств(Данные, Менеджер);
	Данные.КоличествоРеакций = 0;
	Данные.МояРеакция = ложь;

	
	ПрорисовкаФормы_ДобавитьИсходящееСообщение(Данные, ТекущаяСтраница.Имя,,Ложь);  
	Элементы["Чат" + Получатель.Код + "Сообщение"].Заголовок = Лев(ТекстВвода, 40);
	ТекстВвода = "";
	
	ИндексиСообщений = Объект.Сообщения.Добавить();
	ИндексиСообщений.Чат = УИД;
	ИндексиСообщений.Сообщение = Менеджер.Уид_Сообщения;
	//ИндексиСообщений.ИндексЕлемента = ИндексЕлемента;
	ИндексиСообщений.Дата = Менеджер.Дата;
	
	
КонецПроцедуры

Процедура ОтправитьСМС_НаСервер(Данные, Отказ)
	
	Прокси = СоединениеСБазой.ПолучитьПрокси();
	Пароль = Константы.ПарольВхода.Получить();
	
	ДанныеСообщения = Новый Структура;
	ДанныеСообщения.Вставить("Дата", 			Данные.Дата);
	ДанныеСообщения.Вставить("Уид_Получатель", 	Данные.Получатель.УникальныйИдентификатор());
	ДанныеСообщения.Вставить("Уид_Сообщения", 	Данные.Уид_Сообщения);
	ДанныеСообщения.Вставить("Повідомлення",	Данные.Повідомлення);
	ДанныеСообщения.Вставить("ПолучательГруппа",ТипЗнч(Данные.Получатель) = Тип("СправочникСсылка.ГруппыЧата"));
	

	ДанныеКоманды = Новый Структура;
	ДанныеКоманды.Вставить("Команда", "ЗаписатьСообщение");
	ДанныеКоманды.Вставить("Параметры", ДанныеСообщения);
	
	ДвоичныеДанные = Новый ХранилищеЗначения(ДанныеКоманды, Новый СжатиеДанных(9));
	
	Попытка
		Ответ = Прокси.ВыполнитьКоманду(Пароль, ДвоичныеДанные).Получить();
		
		Отказ = НЕ (Ответ.Успешно И Ответ.Данные = Истина) 
	Исключение
		Ошбика = ОписаниеОшибки();
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправкаСообщенияОтправитьНажатие(Элемент)
	Перем Отказ;
	ТекстВвода = мСообщение;
	ОтправкаСообщенияОтправитьНажатиеНаСервере(Отказ);
	
	Если Отказ = Истина Тогда 
		Предупреждение("Повідомлення недоставлено!");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЧатЭлементПолучитьЕщeНажатие(Элемент)
	
	Имя = ПолучитьИмяЭлемента("Чат", Элемент.Подсказка);
	
	ПрорисовкаФормы_Сообщения(Имя, Элемент.Подсказка)
	
КонецПроцедуры


&НаКлиенте
Процедура ОтступНажатие(Элемент)
	Сообщить(4);
КонецПроцедуры


&НаКлиенте
Процедура МенюОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Вставити вміст обробника.
КонецПроцедуры


&НаКлиенте
Процедура МенюСообщенияНажатие(Элемент)
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Скопировать", "Скопіювати");//, , БиблиотекаКартинок.СкопироватьТекст);
	Если СтрНайти(Элемент.имя, "ИсходящееСообщение") Тогда 
		Кнопки.Добавить("Удалить", "Видалити");//, ,БиблиотекаКартинок.Удалить);
	КонецЕсли;
	
	мОтмена = Кнопки.Добавить("Отмена", "Відміна");//, , БиблиотекаКартинок.Назад);
	ДопПараметры = Новый Структура("УИД_Сообщения", Новый УникальныйИдентификатор(Элемент.Подсказка));
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборИзМеню", ЭтаФорма, ДопПараметры);
	ВыбранныйЭлемент = Вопрос("Виберіть дію", Кнопки,, "Отмена", "Чат 1с");
	ОбработатьВыборИзМеню(ВыбранныйЭлемент, ДопПараметры);				//ВыбратьИзМеню(
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборИзМеню(ВыбранныйЭлемент, Параметры) Экспорт 
	Если ВыбранныйЭлемент = "Удалить" Тогда 
		УдалитьСообщение(Параметры.УИД_Сообщения);
	ИначеЕсли ВыбранныйЭлемент = "Скопировать" Тогда 
		СкопироватьСообщение(Параметры.УИД_Сообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСообщение(знач УИД_Сообщения)
	
	Менеджер = РегистрыСведений.УдаленныеСообщения.СоздатьМенеджерЗаписи();
	Менеджер.УИД_Сообщения = УИД_Сообщения;
	Менеджер.Дата = ТекущаяДата();
	Менеджер.Записать();
	
	Элементы.Удалить(Элементы[ПолучитьИмяЭлемента("ИсходящееСообщение", УИД_Сообщения)]);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСообщение(знач УИД_Сообщения)
	
	Текст =  ПолучитьТекстСообщения(УИД_Сообщения);
	Если мБуферОбмена = Неопределено Тогда 
		ВставитьВБуферОбмена(Текст);
		
	Иначе
		мБуферОбмена.УстановитьСодержимое(Текст, "0");
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьТекстСообщения(УИД_Сообщения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВходящиеСообщения.Повідомлення КАК Повідомлення
	|ИЗ
	|	РегистрСведений.ВходящиеСообщения КАК ВходящиеСообщения
	|ГДЕ
	|	ВходящиеСообщения.Уид_Сообщения = &Уид_Сообщения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсходящиеСообщения.Повідомлення
	|ИЗ
	|	РегистрСведений.ИсходящиеСообщения КАК ИсходящиеСообщения
	|ГДЕ
	|	ИсходящиеСообщения.Уид_Сообщения = &Уид_Сообщения";
	
	Запрос.УстановитьПараметр("Уид_Сообщения", Уид_Сообщения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Повідомлення;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ДекорацияПоискНажатие(Элемент)
	мВидимостьПоиска 					= Элемент.Имя = "ДекорацияПоиск";
	Элементы.ТекстПоиска.Видимость 		= мВидимостьПоиска;
	Элементы.ДекорацияПоиск.Видимость 	= Не мВидимостьПоиска;
	Элементы.ОтменаПоиска.Видимость 	= мВидимостьПоиска;
	
	Если Не Элементы.ОсновнаяСтарница.ТекущаяСтраница = Элементы.Чаты Тогда 
		Элементы.ПерепискаГМНазад.Видимость			= Не мВидимостьПоиска;
		Элементы.ПерепискаГМНаименование.Видимость 	= Не мВидимостьПоиска;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ТекстПоискаПриИзмененииНаСервере()
	
	ЦветФона = Новый Цвет(242, 242, 242);
	ЦветФонаБелый = Новый Цвет(255, 255, 255);
	
	Попытка
		УидЧата = Новый УникальныйИдентификатор(Элементы.ОсновнаяСтарница.ТекущаяСтраница.Подсказка);
		ТекущийЧат = Справочники.ГруппыЧата.ПолучитьСсылку(УидЧата);
		Если ТекущийЧат.Пустая() Тогда 
			ТекущийЧат = Справочники.УчасникиЧата.ПолучитьСсылку(УидЧата);
		КонецЕсли;
		
	Исключение
		ТекущийЧат = Неопределено;
	КонецПопытки;
	
	мИмя = Новый Массив;
	Для Каждого Элемент из Элементы.ЧатыПошук.ПодчиненныеЭлементы Цикл 
		мИмя.Добавить(Элемент.Имя);
	КонецЦикла;
	
	Для Каждого Элемент Из  элементы.ОсновнаяСтарница.ПодчиненныеЭлементы Цикл 
		Если СтрНайти(Элемент.Имя, "ЧатПоиск") Тогда
			мИмя.Добавить(Элемент.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	
	Для Каждого Элемент Из мИмя Цикл 
		Элементы.Удалить(Элементы[Элемент]);
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.Відправник КАК Відправник,
	|	ВложенныйЗапрос.ГруппаЧата КАК Ссылка,
	|	ВложенныйЗапрос.Уид_Сообщения КАК Уид_Сообщения,
	|	ВложенныйЗапрос.Повідомлення КАК Повідомлення,
	|	ВложенныйЗапрос.ГруппаЧата.Код КАК Код,
	|	ВложенныйЗапрос.ГруппаЧата.Наименование КАК Наименование,
	|	ВложенныйЗапрос.Входящее КАК Входящее,
	|	ЕСТЬNULL(Реакции.КоличествоРеакций, 0) КАК КоличествоРеакций,
	|	ЕСТЬNULL(Реакции.МояРеакция, ЛОЖЬ) КАК МояРеакция
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВходящиеСообщения.Дата КАК Дата,
	|		ВходящиеСообщения.Відправник КАК Відправник,
	|		ВходящиеСообщения.ГруппаЧата КАК ГруппаЧата,
	|		ВходящиеСообщения.Уид_Сообщения КАК Уид_Сообщения,
	|		ВходящиеСообщения.Повідомлення КАК Повідомлення,
	|		ИСТИНА КАК Входящее
	|	ИЗ
	|		РегистрСведений.ВходящиеСообщения КАК ВходящиеСообщения
	|	ГДЕ
	|		ВходящиеСообщения.Повідомлення ПОДОБНО &Повідомлення
	|		И ВЫБОР
	|				КОГДА &ТекущийЧат = НЕОПРЕДЕЛЕНО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВходящиеСообщения.ГруппаЧата = &ТекущийЧат
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИсходящиеСообщения.Дата,
	|		NULL,
	|		ИсходящиеСообщения.Получатель,
	|		ИсходящиеСообщения.Уид_Сообщения,
	|		ИсходящиеСообщения.Повідомлення,
	|		ЛОЖЬ
	|	ИЗ
	|		РегистрСведений.ИсходящиеСообщения КАК ИсходящиеСообщения
	|	ГДЕ
	|		ИсходящиеСообщения.Повідомлення ПОДОБНО &Повідомлення
	|		И ВЫБОР
	|				КОГДА &ТекущийЧат = НЕОПРЕДЕЛЕНО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ИсходящиеСообщения.Получатель = &ТекущийЧат
	|			КОНЕЦ) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдаленныеСообщения КАК УдаленныеСообщения
	|		ПО ВложенныйЗапрос.Уид_Сообщения = УдаленныеСообщения.УИД_Сообщения
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РекацииНаСобщения.УИД_Сообщения КАК УИД_Сообщения,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РекацииНаСобщения.УчастникЧата) КАК КоличествоРеакций,
	|			МАКСИМУМ(РекацииНаСобщения.УчастникЧата = &ЭтотТорговый) КАК МояРеакция
	|		ИЗ
	|			РегистрСведений.РекацииНаСобщения КАК РекацииНаСобщения
	|		ГДЕ
	|			РекацииНаСобщения.Реакция
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РекацииНаСобщения.УИД_Сообщения) КАК Реакции
	|		ПО ВложенныйЗапрос.Уид_Сообщения = Реакции.УИД_Сообщения
	|ГДЕ
	|	УдаленныеСообщения.УИД_Сообщения ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("ТекущийЧат", ТекущийЧат);
	Запрос.УстановитьПараметр("Повідомлення", "%" + ТекстПоиска + "%");
	Запрос.УстановитьПараметр("ЭтотТорговый", Константы.Пользователь1с.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГруппыЧатов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если Не  ВыборкаГруппыЧатов.Количество() Тогда 
		Сообщить("Повідомлень не знайдено!");
		ТекстПоиска = "";
		Возврат;
	КонецЕсли;
	
	
	Пока ВыборкаГруппыЧатов.Следующий() Цикл 
		Выборка = ВыборкаГруппыЧатов.Выбрать();
		
		Имя = "ЧатПошук" + ВыборкаГруппыЧатов.Код;
		
		ЧатКод = Элементы.Добавить(Имя, Тип("ГруппаФормы"), Элементы.ЧатыПошук);
		ЧатКод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЧатКод.Группировка =  ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ЧатКод.ОтображатьЗаголовок = Ложь;
		//ЧатКод.ВертикальныйИнтервал =  ИнтервалМеждуЭлементамиФормы.Половинный;
		УИД_Чат = ВыборкаГруппыЧатов.Ссылка.УникальныйИдентификатор();
		Элемент = Элементы.Добавить(Имя + "Картинка", Тип("ДекорацияФормы"), ЧатКод);
		Элемент.Вид = ВидДекорацииФормы.Картинка;
		Элемент.Ширина = 6;
		Элемент.Высота = 2;
		Элемент.Картинка = БиблиотекаКартинок.группаЧат1с;
		Элемент.РазмерКартинки = РазмерКартинки.Пропорционально;
		Элемент.УстановитьДействие("Нажатие", "ЧатКодНаименованиеНажатие");
		Элемент.Гиперссылка = Истина;
		Элемент.Подсказка = УИД_Чат; 
		
		ЧатКодГруппа = Элементы.Добавить(Имя + "Группа", Тип("ГруппаФормы"), ЧатКод);
		ЧатКодГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЧатКодГруппа.Группировка =  ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ЧатКодГруппа.ОтображатьЗаголовок = Ложь;
		ЧатКодГруппа.РастягиватьПоГоризонтали = Истина;
		
		Элемент = Элементы.Добавить(Имя + "Наименование", Тип("ДекорацияФормы"), ЧатКодГруппа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Шрифт = Новый Шрифт(,10, Истина);
		Элемент.Гиперссылка = Истина;
		Элемент.Подсказка = УИД_Чат; 
		Элемент.Заголовок = ВыборкаГруппыЧатов.Наименование;
		Элемент.УстановитьДействие("Нажатие", "ЧатКодНаименованиеНажатие");
		
		Элемент = Элементы.Добавить(Имя + "Сообщение", Тип("ДекорацияФормы"), ЧатКодГруппа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = "Знайдено " + Выборка.Количество() + " повідомлень"; 
		Элемент.РастягиватьПоВертикали = ложь;
		Элемент.Высота = 1;
		
		//Элемент = Элементы.Добавить(Имя + "Непрочитаные", Тип("ДекорацияФормы"), ЧатКод);
		//Элемент.Вид = ВидДекорацииФормы.Надпись;
		//Элемент.Заголовок = Формат(Выборка.Количество(), "ЧН=' '");
		//Элемент.Шрифт = Новый Шрифт(,10);
		//Элемент.ЦветТекста = Новый Цвет(225,0,0);
		//Элемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
		//Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		//Элемент.Ширина = 5;
		
		Имя = ПолучитьИмяЭлемента("ЧатПоиск", УИД_Чат);
		Страница = Элементы.Добавить(Имя, Тип("ГруппаФормы"), элементы.ОсновнаяСтарница);
		Страница.Вид = ВидГруппыФормы.Страница;
		Страница.РастягиватьПоГоризонтали = Истина;
		Страница.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
		Страница.Подсказка = УИД_Чат; 
		//ПрорисовкаФормы_СтраницаЧат_Шапка(Имя, Чат.Наименование);
		//Страница.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		Страница.ВертикальнаяПрокруткаПриСжатии = Истина;
		
		Элемент = Элементы.Добавить(Имя + "Картинка", Тип("ДекорацияФормы"), Страница);
		Элемент.Вид = ВидДекорацииФормы.Картинка;
		Элемент.Высота = 1;
		Элемент.РастягиватьПоГоризонтали = Истина;
		Элемент.Картинка = БиблиотекаКартинок.Обновить;
		Элемент.РазмерКартинки = РазмерКартинки.Пропорционально;
		Элемент.УстановитьДействие("Нажатие", "ЧатЭлементПолучитьЕщeНайденыеНажатие");
		Элемент.Подсказка =  УИД_Чат;
		Элемент.Гиперссылка = истина;
		
		
		выводитьДату = Истина;
		Дата = Неопределено;
		Пока Выборка.Следующий() Цикл
			
			Если выводитьДату И Дата <> НачалоДня(Выборка.Дата) Тогда 
				ПрорисовкаФормы_СтраницаЧат_Дата(Имя, Выборка.Дата);
				Дата = НачалоДня(Выборка.Дата);
			КонецЕсли;
			
			Если Выборка.Входящее Тогда 
				//ОтображатьОтправителя = Не Отправитель = Выборка.Відправник;
				ПрорисовкаФормы_ДобавитьВходящееСообщение(Выборка, Имя, Истина,,);
			Иначе 
				ПрорисовкаФормы_ДобавитьИсходящееСообщение(Выборка, Имя,,);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ТекущийЧат = Неопределено Тогда 
		Элементы.ОсновнаяСтарница.ТекущаяСтраница = Элементы.ЧатыПошук;
	Иначе
		Имя = ПолучитьИмяЭлемента("ЧатПоиск", УидЧата);
		Элементы.ОсновнаяСтарница.ТекущаяСтраница = Элементы[Имя];
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПоискаПриИзменении(Элемент)
	Если ПустаяСтрока(ТекстПоиска) Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстПоискаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтменаПоискаНажатие(Элемент)
	ДекорацияПоискНажатие(Элемент);
	ТекстПоиска = "";
	Попытка
		УидЧата = Новый УникальныйИдентификатор(Элементы.ОсновнаяСтарница.ТекущаяСтраница.Подсказка);
		Имя = ПолучитьИмяЭлемента("Чат", УидЧата);
		Элементы.ОсновнаяСтарница.ТекущаяСтраница = Элементы[Имя];	
	Исключение
		Элементы.ОсновнаяСтарница.ТекущаяСтраница = Элементы.Чаты;
		Элементы.ОтправкаСообщения.Видимость = Ложь;
		Элементы.ПерепискаГМНазад.Видимость = Ложь;
		
	КонецПопытки;
	
	ПодключениеДрайверБуфераОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключениеДрайверБуфераОбмена()
	
	Если ПодключитьВнешнююКомпоненту("ОбщийМакет.Component", "Broadcasts", ТипВнешнейКомпоненты.Native) Тогда // com_iksoftware_unimes     		
		мБуферОбмена = Новый ("AddIn.Broadcasts.Clipboard");		
		//Сообщить(мБуферОбмена.СодержимоеБуфера); 
		//
	Иначе
				СообщениеПользователю = Новый СообщениеПользователю();
		СообщениеПользователю.Текст = "Ошибка подключения компоненты ""UniversalBroadcast""";
		СообщениеПользователю.Сообщить();		
	КонецЕсли;	
КонецПроцедуры


Процедура СоздатьЭлементРеакцияНаФорме(Имя, Уид_Сообщения, ПутьКДанным);
	
	Группа = Элементы.Найти(ПолучитьИмяЭлемента("ВходящееСообщение", Уид_Сообщения)+ "ДанныеРеакции");
	Если Группа = Неопределено Тогда 	
		Группа = Элементы.Найти(ПолучитьИмяЭлемента("ИсходящееСообщение", Уид_Сообщения)+ "ДанныеРеакции");
	КонецЕсли;
	Текст = Группа.ПодчиненныеЭлементы[0];
	
	Элемент = Элементы.Вставить(Имя, Тип("ПолеФормы"), Группа, Текст);
	Элемент.Вид 							= ВидПоляФормы.ПолеКартинки;
	Элемент.Ширина 							= 2;
	Элемент.Высота 							= 1;
	Элемент.ПутьКДанным 					= ПутьКДанным;
	Элемент.ПоложениеЗаголовка 				= ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элемент.РазмерКартинки 					= РазмерКартинки.Пропорционально;	
	Элемент.Гиперссылка 					= Истина;
	Элемент.Подсказка 						= Уид_Сообщения; 
	Элемент.РастягиватьПоВертикали 			= Ложь;
	Элемент.РастягиватьПоГоризонтали 		= Ложь;
	Элемент.Рамка  							= Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	Элемент.ВертикальноеПоложениеВГруппе 	= ВертикальноеПоложениеЭлемента.Центр;
	Элемент.УстановитьДействие("Нажатие", "РеакияНажатие");
	
	Попытка 
		мЧисло = Число(Текст.Заголовок); 
	Исключение
		мЧисло = 0;
	КонецПопытки;
	
	Текст.Заголовок = Формат(мЧисло + ?(ПутьКДанным = "Реакция", -1, 1), "ЧДЦ=0");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьРеакцию();
	
	РеакцияНажатиеНаСервере(РеакцияДляЭлемента);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВставитьВБуферОбмена(Текст)
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		Попытка 
			COMОбъект = Новый COMОбъект("htmlfile");
			COMОбъект.ParentWindow.ClipboardData.SetData("Text", Текст);
		Исключение
		КонецПопытки;
	#КонецЕсли
КонецПроцедуры
